Revit 2027 API
STEPExportOptions.TargetUnit Property
 The unit type of geometry in the resultant STEP file. Default value is ExportUnit::Default.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportUnit TargetUnit { get; set; }
Public Property TargetUnit As ExportUnit
	Get
	Set
public:
property ExportUnit TargetUnit {
	ExportUnit get ();
	void set (ExportUnit value);
}
member TargetUnit : ExportUnit with get, set
Property Value
ExportUnit
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
STEPExportOptions Class
Autodesk.Revit.DB Namespace